public class Main {
    public static void main(String[] args) {
        // Метод main - это точка входа в программу. Он вызывается при запуске приложения.
        
        System.out.println("Hello world!"); 
        // Эта строка кода выводит "Hello world!" на стандартный вывод (консоль).
        // System.out - это объект, представляющий стандартный вывод.
        // .println() - метод для вывода текста и перехода на новую строку.
        
        // Эта программа просто выводит приветствие на консоль.
    }
}
